vvpai9/LPC1768-Motor-Safety-Interlock/Keil_v4/ARM/INC/ADI/ADuC7033.inc
T_STIKEY0                      EQU       STIKEY0   -STIBASE   
T_STICON                       EQU       STICON    -STIBASE   
T_STIKEY1                      EQU       STIKEY1   -STIBASE   
T_STIDAT0                      EQU       STIDAT0   -STIBASE   
T_STIDAT1                      EQU       STIDAT1   -STIBASE   
T_STIDAT2                      EQU       STIDAT2   -STIBASE   

STIKEY0_OFFSET                 EQU       0x0880
STICON_OFFSET                  EQU       0x0884
STIKEY1_OFFSET                 EQU       0x0888
STIDAT0_OFFSET                 EQU       0x088C
STIDAT1_OFFSET                 EQU       0x0890
STIDAT2_OFFSET                 EQU       0x0894

; Serial Port Interface Peripheral

SPIBASE                        EQU       0xFFFF0A00
SPISTA                         EQU       0xFFFF0A00
SPIRX                          EQU       0xFFFF0A04
SPITX                          EQU       0xFFFF0A08
SPIDIV                         EQU       0xFFFF0A0C
SPICON                         EQU       0xFFFF0A10
Z_SPISTA                       EQU       SPISTA    -Z_BASE
Z_SPIRX                        EQU       SPIRX     -Z_BASE
Z_SPITX                        EQU       SPITX     -Z_BASE
Z_SPIDIV                       EQU       SPIDIV    -Z_BASE
Z_SPICON                       EQU       SPICON    -Z_BASE

T_SPISTA                       EQU       SPISTA    -SPIBASE   
T_SPIRX                        EQU       SPIRX     -SPIBASE   
T_SPITX                        EQU       SPITX     -SPIBASE   
T_SPIDIV                       EQU       SPIDIV    -SPIBASE   
T_SPICON                       EQU       SPICON    -SPIBASE   

SPISTA_OFFSET                  EQU       0x0A00
SPIRX_OFFSET                   EQU       0x0A04
SPITX_OFFSET                   EQU       0x0A08
SPIDIV_OFFSET                  EQU       0x0A0C
SPICON_OFFSET                  EQU       0x0A10

; GPIO + Serial Port Mux (AHB bus)

GPIOBASE                       EQU       0xFFFF0D00
GP0CON                         EQU       0xFFFF0D00
GP1CON                         EQU       0xFFFF0D04
GP2CON                         EQU       0xFFFF0D08
GP0DAT                         EQU       0xFFFF0D20
GP0SET                         EQU       0xFFFF0D24
GP0CLR                         EQU       0xFFFF0D28
GP1DAT                         EQU       0xFFFF0D30
GP1SET                         EQU       0xFFFF0D34
GP1CLR                         EQU       0xFFFF0D38
GP2DAT                         EQU       0xFFFF0D40
GP2SET                         EQU       0xFFFF0D44
GP2CLR                         EQU       0xFFFF0D48
Z_GP0CON                       EQU       GP0CON    -Z_BASE
Z_GP1CON                       EQU       GP1CON    -Z_BASE
Z_GP2CON                       EQU       GP2CON    -Z_BASE
Z_GP0DAT                       EQU       GP0DAT    -Z_BASE
Z_GP0SET                       EQU       GP0SET    -Z_BASE
Z_GP0CLR                       EQU       GP0CLR    -Z_BASE
Z_GP1DAT                       EQU       GP1DAT    -Z_BASE
Z_GP1SET                       EQU       GP1SET    -Z_BASE
Z_GP1CLR                       EQU       GP1CLR    -Z_BASE
Z_GP2DAT                       EQU       GP2DAT    -Z_BASE
Z_GP2SET                       EQU       GP2SET    -Z_BASE
Z_GP2CLR                       EQU       GP2CLR    -Z_BASE

T_GP0CON                       EQU       GP0CON    -GPIOBASE  
T_GP1CON                       EQU       GP1CON    -GPIOBASE  
T_GP2CON                       EQU       GP2CON    -GPIOBASE  
T_GP0DAT                       EQU       GP0DAT    -GPIOBASE  
T_GP0SET                       EQU       GP0SET    -GPIOBASE  
T_GP0CLR                       EQU       GP0CLR    -GPIOBASE  
T_GP1DAT                       EQU       GP1DAT    -GPIOBASE  
T_GP1SET                       EQU       GP1SET    -GPIOBASE  
T_GP1CLR                       EQU       GP1CLR    -GPIOBASE  
T_GP2DAT                       EQU       GP2DAT    -GPIOBASE  
T_GP2SET                       EQU       GP2SET    -GPIOBASE  
T_GP2CLR                       EQU       GP2CLR    -GPIOBASE  

GP0CON_OFFSET                  EQU       0x0D00
GP1CON_OFFSET                  EQU       0x0D04
GP2CON_OFFSET                  EQU       0x0D08
GP0DAT_OFFSET                  EQU       0x0D20
GP0SET_OFFSET                  EQU       0x0D24
GP0CLR_OFFSET                  EQU       0x0D28
GP1DAT_OFFSET                  EQU       0x0D30
GP1SET_OFFSET                  EQU       0x0D34
GP1CLR_OFFSET                  EQU       0x0D38
GP2DAT_OFFSET                  EQU       0x0D40
GP2SET_OFFSET                  EQU       0x0D44
GP2CLR_OFFSET                  EQU       0x0D48

; Flash Control Interface 32Kbytes (AHB bus)

FLASH0BASE                     EQU       0xFFFF0E00
FEE0STA                        EQU       0xFFFF0E00
FEE0MOD                        EQU       0xFFFF0E04
FEE0CON                        EQU       0xFFFF0E08
FEE0DAT                        EQU       0xFFFF0E0C
FEE0ADR                        EQU       0xFFFF0E10
FEE0SIG                        EQU       0xFFFF0E18
FEE0PRO                        EQU       0xFFFF0E1C
FEE0HID                        EQU       0xFFFF0E20
Z_FEE0STA                      EQU       FEE0STA   -Z_BASE
Z_FEE0MOD                      EQU       FEE0MOD   -Z_BASE
Z_FEE0CON                      EQU       FEE0CON   -Z_BASE
Z_FEE0DAT                      EQU       FEE0DAT   -Z_BASE
Z_FEE0ADR                      EQU       FEE0ADR   -Z_BASE
Z_FEE0SIG                      EQU       FEE0SIG   -Z_BASE
Z_FEE0PRO                      EQU       FEE0PRO   -Z_BASE
Z_FEE0HID                      EQU       FEE0HID   -Z_BASE

T_FEE0STA                      EQU       FEE0STA   -FLASH0BASE
T_FEE0MOD                      EQU       FEE0MOD   -FLASH0BASE
T_FEE0CON                      EQU       FEE0CON   -FLASH0BASE
T_FEE0DAT                      EQU       FEE0DAT   -FLASH0BASE
T_FEE0ADR                      EQU       FEE0ADR   -FLASH0BASE
T_FEE0SIG                      EQU       FEE0SIG   -FLASH0BASE
T_FEE0PRO                      EQU       FEE0PRO   -FLASH0BASE
T_FEE0HID                      EQU       FEE0HID   -FLASH0BASE

FEE0STA_OFFSET                 EQU       0x0E00
FEE0MOD_OFFSET                 EQU       0x0E04
FEE0CON_OFFSET                 EQU       0x0E08
FEE0DAT_OFFSET                 EQU       0x0E0C
FEE0ADR_OFFSET                 EQU       0x0E10
FEE0SIG_OFFSET                 EQU       0x0E18
FEE0PRO_OFFSET                 EQU       0x0E1C
FEE0HID_OFFSET                 EQU       0x0E20

; Flash Control Interface 64Kbytes(AHB bus)

FLASH1BASE                     EQU       0xFFFF0E80
FEE1STA                        EQU       0xFFFF0E80
FEE1MOD                        EQU       0xFFFF0E84
FEE1CON                        EQU       0xFFFF0E88
FEE1DAT                        EQU       0xFFFF0E8C
FEE1ADR                        EQU       0xFFFF0E90
FEE1SIG                        EQU       0xFFFF0E98
FEE1PRO                        EQU       0xFFFF0E9C
FEE1HID                        EQU       0xFFFF0EA0
Z_FEE1STA                      EQU       FEE1STA   -Z_BASE
Z_FEE1MOD                      EQU       FEE1MOD   -Z_BASE
Z_FEE1CON                      EQU       FEE1CON   -Z_BASE
Z_FEE1DAT                      EQU       FEE1DAT   -Z_BASE
Z_FEE1ADR                      EQU       FEE1ADR   -Z_BASE
Z_FEE1SIG                      EQU       FEE1SIG   -Z_BASE
Z_FEE1PRO                      EQU       FEE1PRO   -Z_BASE
Z_FEE1HID                      EQU       FEE1HID   -Z_BASE

T_FEE1STA                      EQU       FEE1STA   -FLASH1BASE
T_FEE1MOD                      EQU       FEE1MOD   -FLASH1BASE
T_FEE1CON                      EQU       FEE1CON   -FLASH1BASE
T_FEE1DAT                      EQU       FEE1DAT   -FLASH1BASE
T_FEE1ADR                      EQU       FEE1ADR   -FLASH1BASE
T_FEE1SIG                      EQU       FEE1SIG   -FLASH1BASE
T_FEE1PRO                      EQU       FEE1PRO   -FLASH1BASE
T_FEE1HID                      EQU       FEE1HID   -FLASH1BASE

FEE1STA_OFFSET                 EQU       0x0E80
FEE1MOD_OFFSET                 EQU       0x0E84
FEE1CON_OFFSET                 EQU       0x0E88
FEE1DAT_OFFSET                 EQU       0x0E8C
FEE1ADR_OFFSET                 EQU       0x0E90
FEE1SIG_OFFSET                 EQU       0x0E98
FEE1PRO_OFFSET                 EQU       0x0E9C
FEE1HID_OFFSET                 EQU       0x0EA0
